

Network Working Group           A. Conta (Digital Equipment Corporation)
INTERNET-DRAFT                        S. Deering (Xerox PARC)
                                            February 1995                 |


            ICMP for the Internet Protocol Version 6 (IPv6)
                     draft-ietf-ipngwg-icmp-01.txt                        |


Status of this Memo

   This document is an Internet  Draft.   Internet  Drafts  are  working
   documents  of  the Internet Engineering Task Force (IETF), its Areas,
   and its Working Groups. Note that other groups  may  also  distribute
   working documents as Internet Drafts.

   Internet Drafts are draft  documents  valid  for  a  maximum  of  six
   months.  Internet  Drafts  may  be updated, replaced, or obsoleted by
   other documents at any time.  It is not appropriate to  use  Internet
   Drafts as reference material or to cite them other than as a "working
   draft" or "work in progress."

   To learn the current status of any Internet-Draft, please  check  the
   ``1id-abstracts.txt''  listing  contained  in  the  Internet-  Drafts
   Shadow Directories on ds.internic.net (US East Coast),  nic.nordu.net
   (Europe),  ftp.isi.edu  (US  West  Coast),  or munnari.oz.au (Pacific
   Rim).

   Distribution of this memo is unlimited.

Abstract


   This document specifies a set of Internet  Control  Message  Protocol
   (ICMP)  messages  for  use  with  version  6 of the Internet Protocol
   (IPv6).  The  Internet  Group  Management  Protocol  (IGMP)  messages
   specified  in  RFC-1112 have been merged into ICMP, for IPv6, and are
   included in this document.













Conta & Deering       Expires in six months         [Page 1]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


Table of Contents



1. Introduction........................................3                  |
2. ICMP for IPv6.......................................3                  |
3. ICMP Error Messages.................................7                  |
      3.1 Destination Unreachable Message..............7                  |
      3.2 Packet Too Big Message.......................8                  |
      3.3 Time Exceeded Message........................9                  |
      3.4 Parameter Problem Message...................11                  |
4. ICMP Informational Messages........................12                  |
      4.1 Echo Request Message........................12                  |
      4.2 Echo Reply Message..........................13                  |
      4.3 Group Membership Messages...................15                  |
5. References.........................................16                  |
6. Acknowledgements...................................17                  |
7. Security Considerations............................17                  |
8. Authors' Addresses.................................17                  |
































Conta & Deering       Expires in six months         [Page 2]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


1.   Introduction                                                         |

   The Internet Protocol, version 6 (IPv6) is a new version of IP.  IPv6
   uses the Internet Control Message Protocol (ICMP) as defined for
   IPv4 [RFC-792],  with  a  number  of  changes.   The  Internet  Group  |
   Membership                                                             |
   Protocol (IGMP) specified for IPv4 [RFC-1112] has also  been  revised
   and has been absorbed into ICMP for IPv6.

   This document describes the format of a set of control messages  used
   in ICMP
   for IPv6.  It does  not  describe  the  procedures  for  using  these  |
   messages  to  achieve  functions like Path MTU discovery or multicast  |
   group membership maintenance; such procedures are described in  other  |
   documents  (e.g.,  [RFC-1112,  RFC-1191]).   Other documents may also  |
   introduce additional ICMP message types, such as  Neighbor  Discovery  |
   messages  [IPv6-DISC], subject to the general rules for ICMP messages  |
   given in section 2 of this document.                                   |

   Terminology defined in the IPv6 specification  [IPv6]  and  the  IPv6
   Routing  and  Addressing  specification  [IPv6-ADDR]  applies to this
   document as well.


2.   ICMP for IPv6

   IPv6 ICMP is used by IPv6  nodes  to  report  errors  encountered  in
   processing packets, and to perform other internet-layer functions,
   such as diagnostics (ICMP "ping") and multicast                        |
   membership reporting.  IPv6 ICMP is an integral part of IPv6 and MUST
   be implemented by every IPv6 node.

   ICMP messages are  grouped  into  two  classes:  error  messages  and  |
   informational  messages.   Error  messages  are identified as such by  |
   having a zero in the high-order bit of  their  message  Type  values.  |
   Thus,  error messages have message Types from 0 to 127; informational  |
   messages have message Types from 128 to 255.                           |

   This document defines the message formats for the following IPv6 ICMP  |
   messages:                                                              |











Conta & Deering       Expires in six months         [Page 3]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


        ICMP error messages:                                              |
            1  Destination Unreachable      (see section 3.1)             |
            2  Packet Too Big               (see section 3.2)             |
            3  Time Exceeded                (see section 3.3)             |
            4  Parameter Problem            (see section 3.4)             |
        ICMP informational messages:                                      |
          128  Echo Request                 (see section 4.1)             |
          129  Echo Reply                   (see section 4.2)             |
          130  Group Membership Qeury       (see section 4.3)             |
          131  Group Membership Report      (see section 4.3)             |
          132  Group Membership Termination (see section 4.3)             |


   Every IPv6 ICMP message is preceded by an IPv6  header  and  zero  or  |
   more                                                                   |
   IPv6 extension headers.  The ICMP header  is  identified  by  a  Next  |
   Header  value  of  <TBD> in the immediately preceding header.  (NOTE:  |
   this is different than the value used to identify ICMP for IPv4.)      |

   The IPv6 ICMP messages have the following general format:


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |     Code      |          Checksum             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |   |
      +                         Message Body                          +   |
      |                                                               |   |


   The  type  field  indicates  the  type  of  the  message.  Its  value  |
   determines the format of the remaining data.                           |

   The code field depends on the message type. It is used to  create  an
   additional level of message granularity.

   The checksum is the 16-bit one's complement of the  one's  complement
   sum of the IPv6 Source Address, the IPv6 Destination
   Address (the final destination, if a Routing Header is  being  used),  |
   the  IPv6  Payload  Length, the Next Header type that identifies IPv6  |
   ICMP(<TBD>), and the entire  ICMP  message  starting  with  the  ICMP  |
   message type. For                                                      |
   computing the checksum, the checksum field is set to zero.
   (NOTE: the inclusion of the IPv6 header fields in the  ICMP  checksum  |
   is a change from IPv4; see [IPv6] for the rationale for this change.)  |




Conta & Deering       Expires in six months         [Page 4]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


   Implementation Notes:                                                  |

   A node that sends an ICMP message has to determine both                |
   the Source and Destination IPv6 Addresses in the IPv6  header  before
   calculating the checksum.
   If the node has more than one unicast address,  it  must  choose  the  |
   Source Address of the message as follows:                              |

      If the message is a response to a  message  sent  to  one  of  the  |
      node's  unicast  address,  the Source Address of the reply must be  |
      that same address.                                                  |

      If the message is a response to a  message  sent  to  a  multicast  |
      group  in  which  the  node is a member, the Source Address of the  |
      reply must be a unicast address  belonging  to  the  interface  on  |
      which the multicast packet was received.                            |

      Otherwise, the node's routing table must be examined to  determine  |
      which  interface  will  be  used  to  transmit  the message to its  |
      destination, and a unicast address  belonging  to  that  interface  |
      must be used as the Source Address of the message.                  |

   Implementations MUST observe the following rules when processing IPv6
   ICMP messages (from [RFC-1122]):

  (a)  If an IPv6 ICMP message of unknown type is received, it  MUST  be
       silently discarded.

  (b)  Every IPv6 ICMP error message (the first  four  messages  in  the
       above  list)  includes  as  much of the IPv6 offending (invoking)
       packet (the packet that causes the error)  as  will  fit  without
       making the error message packet exceed 576 octets.

  (c)  In those cases where the Internet layer is  required  to  pass  a  |
       IPv6  ICMP  error  message  to  the  transport  layer,  the  IPv6  |
       Transport                                                          |
       Protocol is extracted from the original header (contained in       |
       the body of the IPv6 ICMP error message) and used to  select  the
       appropriate transport protocol entity to handle the error.

  (d)  An IPv6 ICMP error message MUST  NOT  be  sent  as  a  result  of
       receiving:


          (d.1.)an IPv6 ICMP error message, or                            |






Conta & Deering       Expires in six months         [Page 5]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


          (d.2.)a packet destined  to  an  IPv6  multicast  address  (an  |
               exception  to  this  rule is the Packet Too Big Message -
               Section 3.2 - to allow Path MTU  discovery  to  work  for
               IPv6 multicast), or

          (d.3.)                                                          |
               a packet sent as a link-layer multicast,  (the  exception  |
               from d.2.  applies to this case too) or                    |

          (d.4.)
               a packet sent as a link-layer broadcast,  (the  exception  |
               from d.2.  applies to this case too) or                    |

          (d.5.)a packet whose source address does not uniquely identify
               a  single  node -- e.g., the IPv6 Unspecified Address, or
               an IPv6 multicast address.


       (e)  Finally, to each sender of an erroneous data packet, an IPv6
            node
            MUST limit the rate of ICMP error messages sent, in order to  |
            limit the bandwidth and forwarding costs incurred by the the  |
            error messages when a generator of  erroneous  packets  does  |
            not   respond   to  those  error  messages  by  ceasing  its  |
            transmissions.  There are a variety of ways of  implementing  |
            the rate-limiting function, for example:                      |


          (e.1.)Timer-based  -  for  example,  limiting  the   rate   of  |
               transmission  of  error messages to a given source, or to  |
               any source, to at most once every T milliseconds.          |

          (e.2.)Bandwidth-based - for  example,  limiting  the  rate  at  |
               which error messages are sent from a particular interface  |
               to some fraction F of the attached link's bandwidth.       |


            The limit parameters (e.g., T or F in  the  above  examples)  |
            MUST  be  configurable  for  the  node,  with a conservative  |
            default value (e.g., T = 1 second, NOT 0 seconds, or F  =  2  |
            percent, NOT 100 percent).                                    |

   The following sections describe the message  formats  for  the  above
   IPv6 ICMP messages.







Conta & Deering       Expires in six months         [Page 6]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


3.   ICMP Error Messages

3.1. Destination Unreachable Message


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |     Code      |          Checksum             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                             Unused                            |   |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                    As much of invoking packet                 |
      +                   as will fit without ICMP packet             +   |
      |                       exceeding 576 octets                    |
      +                                                               +   |
      |                                                               |

IPv6 Fields:                                                              |

   Destination Address                                                    |
                  Copied from the Source Address field of the invoking    |
                  packet.                                                 |

IPv6 ICMP Fields:                                                         |

   Type           1                                                       |

   Code           0 - no route to destination                             |
                  1 - communication with destination                      |
                        administratively prohibited                       |
                  3 - address unreachable                                 |
                  4 - port unreachable                                    |

   Unused         This field is unused for all code values.
                  It must be initialized to zero by the sender
                  and ignored by the receiver.


Description

   A Destination Unreachable message SHOULD be generated by a router, or  |
   by  the  IPv6  layer in the originating node, in response to a packet  |
   that cannot be delivered to its destination address for reasons other  |
   than  congestion.  (If a packet is dropped due to congestion, no ICMP  |
   error message is generated.)   If  the  reason  for  the  failure  to  |
   deliver  is lack of a matching entry in the forwarding node's routing  |
   table, the Code field is set to 0 (NOTE: this error can occur only in  |



Conta & Deering       Expires in six months         [Page 7]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


   routers  that do not hold a "default route" in their routing tables).  |
   If  the  reason  for  the  failure  to  deliver   is   administrative  |
   prohibition,  e.g.,  a "firewall filter", the Code field is set to 1.  |
   If there is any other  reason  for  the  failure  to  deliver,  e.g.,  |
   inability   to   resolve   the   IPv6   destination  address  into  a  |
   corresponding link address, or a link-specific problem of some  sort,  |
   then the Code field is set to 3.                                       |

   A destination node SHOULD send a Destination Unreachable message with  |
   Code  4  in  response  to  a  packet for which the transport protocol  |
   (e.g., UDP) has no  listener,  if  that  transport  protocol  has  no  |
   alternative means to inform the sender.                                |

Upper layer notification                                                  |

   A node receiving the ICMP Destination Unreachable message MUST notify  |
   the upper layer.                                                       |



3.2.                                                                      |
     Packet Too Big Message                                               |

       0                   1                   2                   3      |
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |     Code      |          Checksum             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                             MTU                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                    As much of invoking packet                 |
      +                   as will fit without ICMP packet             +   |
      |                       exceeding 576 octets                    |
      +                                                               +   |
      |                                                               |


IPv6 Fields:                                                              |

   Destination Address                                                    |
                  Copied from the Source Address field of the invoking    |
                  packet.                                                 |









Conta & Deering       Expires in six months         [Page 8]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


IPv6 ICMP Fields:                                                         |

   Type           2                                                       |

   Code           0

   MTU            The Maximum Transmission Unit of the next-hop link.     |

Description

   A Packet Too Big MUST be sent by a router in
   response to a packet that it cannot forward  because  the  packet  is  |
   larger  than  the  MTU of the outgoing link.  The information in this  |
   message is used as part of the Path MTU Discovery process [RFC-1191].  |

   Sending a Packet Too Big Message makes an exception to the  rules  of  |
   when to send an ICMP error message, in that unlike other messages, it  |
   is sent in response to a  packet  received  with  an  IPv6  multicast  |
   destination   address,   or  a  link-layer  multicast  or  link-layer  |
   broadcast address.                                                     |

Upper layer notification

   An incoming Packet Too Big message MUST be passed  to  the  transport
   layer.


3.3.
     Time Exceeded Message                                                |

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |     Code      |          Checksum             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                             Unused                            |   |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                    As much of invoking packet                 |
      +                   as will fit without ICMP packet             +   |
      |                       exceeding 576 octets                    |
      +                                                               +   |
      |                                                               |









Conta & Deering       Expires in six months         [Page 9]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


IPv6 Fields:                                                              |

   Destination Address                                                    |
                  Copied from the Source Address field of the invoking    |
                  packet.                                                 |

IPv6 ICMP Fields:                                                         |

   Type           3                                                       |

   Code           0 - hop limit exceeded in transit

                  1 - fragment reassembly time exceeded


   Unused         This field is unused for all code values.               |
                  It must be initialized to zero by the sender            |
                  and ignored by the receiver.                            |


Description

   If a router receives a packet with a Hop Limit of zero, or  a  router
   decrements  a  packet's Hop Limit to zero, it discards the packet and
   sends an IPv6 ICMP Time Exceeded message with
   Code 0 to the source of the packet.  This indicates either a  routing  |
   loop or too small an initial                                           |
   Hop Limit value.

   IPv6 systems are expected to avoid fragmentation by implementing Path
   MTU discovery.  However, IPv6 defines an end-to-end fragmentation
   function  for  backwards  compatibility  with  existing  higher-layer  |
   protocols.    All   IPv6  implementations  are  required  to  support  |
   reassembly                                                             |
   of  IPv6  fragments.   There  MUST  be  a  reassembly  timeout.   The
   reassembly  timeout  SHOULD be a fixed value.  It is recommended that
   this value lie between 60 and 120 seconds.  If the  timeout  expires,
   the
   partially-reassembled packet MUST be discarded. If the fragment        |
   with offset zero was received, the destination host SHOULD also send
   an IPv6 ICMP Time Exceeded message with Code 1 to the source  of  the  |
   fragment.                                                              |









Conta & Deering       Expires in six months        [Page 10]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


Upper layer notification

   An incoming Time Exceeded message MUST be  passed  to  the  transport
   layer.


3.4.                                                                      |
     Parameter Problem Message

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |     Code      |          Checksum             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                            Pointer                            |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                    As much of invoking packet                 |
      +                   as will fit without ICMP packet             +   |
      |                       exceeding 576 octets                    |
      +                                                               +   |
      |                                                               |


IPv6 Fields:                                                              |

   Destination Address                                                    |
                  Copied from the Source Address field of the invoking    |
                  packet.                                                 |

IPv6 ICMP Fields:                                                         |

   Type           4                                                       |

   Code           0 - erroneous header field encountered                  |

                  1 - unrecognized Next Header type encountered           |

                  2 - unrecognized IPv6 option encountered                |

   Pointer        identifies the octet offset within the
                  invoking packet where the error was detected.           |

                  The pointer will point beyond the end of the ICMP       |
                  packet if the field in error is beyond what can fit     |
                  in the 576-byte limit of an ICMP error message.         |


Description



Conta & Deering       Expires in six months        [Page 11]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


   If an IPv6 node processing a packet finds a problem with a  field  in  |
   the  IPv6  header  or  extension headers such that it cannot complete  |
   processing the packet, it MUST discard the packet and SHOULD send  an  |
   ICMP Parameter Problem message to the packet's source, indicating the  |
   type and location of the problem.                                      |

Upper layer notification

   A node receiving this ICMP message MUST notify the upper layer.


4.                                                                        |
     ICMP Informational Messages                                          |

4.1.
     Echo Request Message                                                 |

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |     Code      |          Checksum             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |           Identifier          |        Sequence Number        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Data ...
      +-+-+-+-+-


IPv6 Fields:                                                              |

   Destination Address                                                    |
                  Any legal IPv6 address.                                 |
                                                                          |
IPv6 ICMP Fields:

   Type           128                                                     |

   Code           0

   Identifier     If code = 0, an identifier to aid in matching           |
                  Echo Replies to this Echo Request.  May be zero.        |

   Sequence       If code = 0, a sequence number to aid in matching       |
   Number         Echo Replies to this Echo Request.  May be zero.        |

   Data           If code = 0, zero or more octets of arbitrary data.     |





Conta & Deering       Expires in six months        [Page 12]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


Description

   Every node MUST implement an ICMP Echo responder function that         |
   receives Echo Requests and sends corresponding Echo Replies.  A  node
   SHOULD also implement an application-layer interface
   for sending Echo Requests and receiving Echo Replies, for              |
   diagnostic purposes.


Upper layer notification                                                  |

   A node receiving this ICMP message MAY notify the upper layer.         |


4.2.                                                                      |
     Echo Reply Message                                                   |

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |     Code      |          Checksum             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |           Identifier          |        Sequence Number        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Data ...
      +-+-+-+-+-


IPv6 Fields:                                                              |

   Destination Address                                                    |
                  Copied from the Source Address field of the invoking    |
                  Echo Request packet.                                    |

IPv6 ICMP Fields:                                                         |

   Type           129                                                     |

   Code           0

   Identifier     If code = 0, the identifier from the invoking           |
                  Echo Request message.                                   |

   Sequence       If code = 0, the sequence number from the invoking      |
   Number         Echo Request message.                                   |

   Data           If code = 0, the data from the invoking                 |
                  Echo Request message                                    |



Conta & Deering       Expires in six months        [Page 13]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


Description

   Every node MUST implement an ICMP Echo responder function that         |
   receives Echo Requests and sends corresponding Echo Replies.  A  node
   SHOULD also implement an application-layer interface
   for sending Echo Requests and receiving Echo Replies, for              |
   diagnostic purposes.

   The source address of an Echo Reply sent in  response  to  a  unicast  |
   Echo  Request  message MUST be the same as the destination address of  |
   that Echo Request message.                                             |

   An Echo Reply SHOULD be sent in response to an Echo  Request  message  |
   sent                                                                   |
   to an IPv6 multicast address.  The source address of the  reply  MUST
   be a unicast address belonging to the interface on which
   the multicast Echo Request message was received.                       |

   The data received in the ICMP Echo Request message MUST  be  returned  |
   entirely  and  unmodified  in the ICMP Echo Reply message, unless the  |
   Echo Reply would exceed  the  MTU  of  the  path  back  to  the  Echo  |
   requester, in which case the data is truncated to fit that path MTU.   |


Upper layer notification

   Echo Reply messages MUST be passed to the ICMP user interface, unless
   the corresponding Echo Request originated in the IP layer.























Conta & Deering       Expires in six months        [Page 14]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


4.3.                                                                      |
     Group Membership Messages                                            |

   The ICMP Group Membership Messages have the following format:          |


       0                   1                   2                   3      |
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+   |
      |     Type      |     Code      |          Checksum             |   |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+   |
      |     Maximum Response Delay    |          Unused               |   |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      +                                                               +
      |                          Multicast                            |
      +                                                               +
      |                           Address                             |
      +                                                               +
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


IPv6 Fields:                                                              |

   Destination Address                                                    |
                  In a Group Membership Query message, the multicast      |
                  address of the group being queried, or the Link-Local   |
                  All-Nodes multicast address.                            |

                  In a Group Membership Report or a Group Membership      |
                  Termination message, the multicast address of the       |
                  group being reported or terminated.                     |

   Hop Limit      1                                                       |
















Conta & Deering       Expires in six months        [Page 15]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


IPv6 ICMP Fields:

   Type           130 - Group Membership Query                            |
                  131 - Group Membership Report                           |
                  132 - Group Membership Termination                      |

   Code           0                                                       |

   Maximum Response Delay                                                 |
                  In Query messages, the maximum time that responding     |
                  Report messages may be delayed, in milliseconds.        |

                  In Report and Termination messages, this field is       |
                  is initialized to zero by the sender and ignored by
                  receivers.

   Unused         Initialized to zero by the sender; ignored by receivers.

   Multicast Address
                  The address if the multicast group about which the
                  message is being sent.  In Query messages, the Multicast
                  Address field may be zero, implying a query for all
                  groups.



Description

   The ICMP Group Membership messages are  used  to  convey  information  |
   about                                                                  |
   multicast group membership from nodes to their  neighboring  routers.
   The details of their usage is given in [RFC-1112].



5.   References                                                           |



     [IPv6]R. Hinden, "Internet Protocol Version 6 Specification",        |
          February 1995                                                   |


     [IPv6-ADDR]
          R.  Hinden,  "IP  Next  Generation  Addressing  Architecture",  |
          February 1995                                                   |





Conta & Deering       Expires in six months        [Page 16]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995


     [IPv6-DISC]
          W. A. Simpson, "IPv6 Neighbor Discovery", February 1995         |


     [RFC-792]                                                            |
          J. Postel, "Internet Control Message Protocol", RFC 792.        |


     [RFC-1112]                                                           |
          S. Deering, "Host Extensions for IP Multicasting", RFC 1112.    |


     [RFC-1122]                                                           |
          R. Braden, "Requirements for Internet  Hosts  -  Communication  |
          Layers", RFC 1122.                                              |


     [RFC-1191]                                                           |
          J. Mogul and S. Deering, "Path MTU Discovery", RFC 1191.        |





6.   Acknowledgements                                                     |

   The document is derived from the "ICMP and IGMP  for  SIPP"  document
   published  as  a  draft by Ramesh Govindan and Steve Deering in March
   1994.

   The working group and particularly Robert Elz, Jim  Bound,  and  Bill  |
   Simpson provided extensive review information and feedback.            |


7.   Security Considerations                                              |

   Security considerations are not discussed in this memo.


Authors' Addresses:

   Alex Conta                               Stephen Deering
   Digital Equipment Corporation            Xerox Palo Alto Research Center
   110 Spitbrook Rd                         3333 Coyote Hill Road
   Nashua, NH 03062                         Palo Alto, CA 94304
   +1-603-881-0744                          +1-415-812-4839

   email: conta@zk3.dec.com                 email: deering@parc.xerox.com



Conta & Deering       Expires in six months        [Page 17]

INTERNET-DRAFT               ICMP for IPv6             February 27, 1995






















































